OdDAI.SafePathHolder.reserve(System.UInt64!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reserve buffer by size
\param addeValue [in] size of buffer.

OdDAI.SafePathHolder.clearAll
\details
Remove all data, clear all buffers.

OdDAI.SafePathHolder.add(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*!System.Runtime.CompilerServices.IsConst)
\details
Append additional value to array of type pathes.
\param addeValue [in] original type path, should looks like:"type1/type2/type3".

OdDAI.SafePathHolder.putPath(std.basic_string&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,std.char_traits{System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte},std.allocator&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a path array.
\param typeNameNumber [in] original type path, should looks like:"type1/type2/type3".

OdDAI.SafePathHolder.putPath(System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**)
\details
Sets a path array.
\param typeNameNumber [in] count of array items.
\param typeNameVector [in] array of pathes.

OdDAI.SafePathHolder.getPath(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Provides a path array.
\param typeNameNumber [out] count items at provided array.
\returns the row pointer to the array, can return nullptr if the path is empty.

OdDAI.SafePathHolder.op_Assign(OdDAI.SafePathHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy one path holder to another.
\param rightValue [in] path holder to copy from.
\returns the reference to itself.

OdDAI.SafePathHolder.op_Equality(OdDAI.SafePathHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compare two path holders.
\param rightValue [in] path holder to compare.
\returns true if equal, and false otherwise.

OdDAI.SafePathHolder.Dispose
\details
Destroys path holder.

OdDAI.SafePathHolder.#ctor(OdDAI.SafePathHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor copy. Creates a new empty path holder and init data from rightValue.
\param rightValue [in] path holder to copy from.

OdDAI.SafePathHolder
\details
A class that holdes path of the select data.